; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/rovers/domain.pddl
;; updates:
;;   - since actions are performed sequentially and immediately
;;     'channel_free' and 'available' predicates are removed
;;   -

(define (domain rover)
(:requirements :strips :typing)
(:types rover waypoint store camera mode lander objective)

(:predicates
    (at ?x - rover ?y - waypoint)
    (at_lander ?x - lander ?y - waypoint)
    (can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
    (equipped_for_rock_analysis ?r - rover)
    (equipped_for_imaging ?r - rover)
    (empty ?s - store)
    (have_rock_analysis ?r - rover ?w - waypoint)
    (have_soil_analysis ?r - rover ?w - waypoint)
    (full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
    (visible ?w - waypoint ?p - waypoint)
    (have_image ?r - rover ?o - objective ?m - mode)
    (communicated_soil_data ?w - waypoint)
    (communicated_rock_data ?w - waypoint)
    (communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
    (visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
)

(:action navigate
:parameters (?x - rover ?y - waypoint ?z - waypoint)
:precondition (and
    ; (can_traverse ?x ?y ?z)
    (at ?x ?y)
    ; (visible ?y ?z)
    )
:effect (and
    (not (at ?x ?y))
    (at ?x ?z))
)

(:action sample_soil
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_soil_sample ?p)
	(equipped_for_soil_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_soil_analysis ?x ?p)
    (not (at_soil_sample ?p)))
)

(:action sample_rock
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_rock_sample ?p)
	(equipped_for_rock_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_rock_analysis ?x ?p)
	(not (at_rock_sample ?p)))
)

(:action drop
:parameters (?x - rover ?y - store)
:precondition (and
    (store_of ?y ?x)
    (full ?y))
:effect (and
    (not (full ?y))
    (empty ?y))
)

(:action calibrate
 :parameters (?r - rover ?i - camera ?t - objective ?w - waypoint)
 :precondition (and
    (equipped_for_imaging ?r)
    (calibration_target ?i ?t)
    (at ?r ?w)
    (visible_from ?t ?w)
    (on_board ?i ?r))
 :effect (and
    (calibrated ?i ?r))
)

(:action take_image
 :parameters (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
 :precondition (and
    (calibrated ?i ?r)
    (on_board ?i ?r)
    (equipped_for_imaging ?r)
    (supports ?i ?m)
    (visible_from ?o ?p)
    (at ?r ?p))
 :effect (and
    (have_image ?r ?o ?m)
    (not (calibrated ?i ?r)))
)

(:action communicate_soil_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_soil_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_soil_data ?p))
)

(:action communicate_rock_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_rock_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_rock_data ?p))
)

(:action communicate_image_data
 :parameters (?r - rover ?l - lander ?o - objective ?m - mode
	      ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_image ?r ?o ?m)
    (visible ?x ?y))
 :effect (and
    (communicated_image_data ?o ?m)))
)

; problem
;; rovers=4, waypoints=10, cameras=4, objectives=10, out_folder=training/easy, instance_id=98, seed=133

(define (problem rover-98)
 (:domain rover)
 (:objects 
    general - lander
    colour high_res low_res - mode
    rover1 rover2 rover3 rover4 - rover
    rover1store rover2store rover3store rover4store - store
    waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 waypoint8 waypoint9 waypoint10 - waypoint
    camera1 camera2 camera3 camera4 - camera
    objective1 objective2 objective3 objective4 objective5 objective6 objective7 objective8 objective9 objective10 - objective)
 (:init 
    (at_lander general waypoint8)
    (at rover1 waypoint6)
    (at rover2 waypoint8)
    (at rover3 waypoint6)
    (at rover4 waypoint10)
    (equipped_for_soil_analysis rover2)
    (equipped_for_rock_analysis rover2)
    (equipped_for_rock_analysis rover1)
    (equipped_for_rock_analysis rover3)
    (equipped_for_imaging rover3)
    (equipped_for_imaging rover4)
    (equipped_for_imaging rover2)
    (equipped_for_imaging rover1)
    (empty rover1store)
    (empty rover2store)
    (empty rover3store)
    (empty rover4store)
    (store_of rover1store rover1)
    (store_of rover2store rover2)
    (store_of rover3store rover3)
    (store_of rover4store rover4)
    (at_rock_sample waypoint1)
    (at_rock_sample waypoint2)
    (at_rock_sample waypoint4)
    (at_rock_sample waypoint5)
    (at_rock_sample waypoint8)
    (at_rock_sample waypoint10)
    (at_soil_sample waypoint1)
    (at_soil_sample waypoint2)
    (at_soil_sample waypoint4)
    (at_soil_sample waypoint8)
    (at_soil_sample waypoint9)
    (visible waypoint6 waypoint2)
    (visible waypoint10 waypoint5)
    (visible waypoint2 waypoint4)
    (visible waypoint3 waypoint8)
    (visible waypoint9 waypoint3)
    (visible waypoint1 waypoint5)
    (visible waypoint5 waypoint1)
    (visible waypoint4 waypoint2)
    (visible waypoint6 waypoint7)
    (visible waypoint9 waypoint5)
    (visible waypoint7 waypoint6)
    (visible waypoint2 waypoint6)
    (visible waypoint5 waypoint10)
    (visible waypoint3 waypoint9)
    (visible waypoint8 waypoint3)
    (visible waypoint5 waypoint9)
    (visible waypoint2 waypoint5)
    (visible waypoint5 waypoint2)
    (visible waypoint2 waypoint3)
    (visible waypoint3 waypoint2)
    (visible waypoint3 waypoint6)
    (visible waypoint6 waypoint3)
    (visible waypoint2 waypoint7)
    (visible waypoint7 waypoint2)
    (visible waypoint4 waypoint7)
    (visible waypoint7 waypoint4)
    (visible waypoint1 waypoint4)
    (visible waypoint4 waypoint1)
    (visible waypoint3 waypoint4)
    (visible waypoint4 waypoint3)
    (visible waypoint1 waypoint9)
    (visible waypoint9 waypoint1)
    (visible waypoint4 waypoint9)
    (visible waypoint9 waypoint4)
    (visible waypoint7 waypoint8)
    (visible waypoint8 waypoint7)
    (visible waypoint8 waypoint9)
    (visible waypoint9 waypoint8)
    (visible waypoint4 waypoint8)
    (visible waypoint8 waypoint4)
    (visible waypoint4 waypoint10)
    (visible waypoint10 waypoint4)
    (visible waypoint2 waypoint10)
    (visible waypoint10 waypoint2)
    (visible waypoint4 waypoint6)
    (visible waypoint6 waypoint4)
    (visible waypoint2 waypoint8)
    (visible waypoint8 waypoint2)
    (visible waypoint7 waypoint10)
    (visible waypoint10 waypoint7)
    (visible waypoint7 waypoint9)
    (visible waypoint9 waypoint7)
    (can_traverse rover1 waypoint6 waypoint2)
    (can_traverse rover1 waypoint10 waypoint5)
    (can_traverse rover1 waypoint2 waypoint4)
    (can_traverse rover1 waypoint3 waypoint8)
    (can_traverse rover1 waypoint9 waypoint3)
    (can_traverse rover1 waypoint1 waypoint5)
    (can_traverse rover1 waypoint5 waypoint1)
    (can_traverse rover1 waypoint4 waypoint2)
    (can_traverse rover1 waypoint6 waypoint7)
    (can_traverse rover1 waypoint9 waypoint5)
    (can_traverse rover1 waypoint7 waypoint6)
    (can_traverse rover1 waypoint2 waypoint6)
    (can_traverse rover1 waypoint5 waypoint10)
    (can_traverse rover1 waypoint3 waypoint9)
    (can_traverse rover1 waypoint8 waypoint3)
    (can_traverse rover1 waypoint5 waypoint9)
    (can_traverse rover1 waypoint2 waypoint5)
    (can_traverse rover1 waypoint5 waypoint2)
    (can_traverse rover1 waypoint4 waypoint7)
    (can_traverse rover1 waypoint7 waypoint4)
    (can_traverse rover1 waypoint1 waypoint4)
    (can_traverse rover1 waypoint4 waypoint1)
    (can_traverse rover1 waypoint3 waypoint4)
    (can_traverse rover1 waypoint4 waypoint3)
    (can_traverse rover1 waypoint4 waypoint9)
    (can_traverse rover1 waypoint9 waypoint4)
    (can_traverse rover1 waypoint7 waypoint8)
    (can_traverse rover1 waypoint8 waypoint7)
    (can_traverse rover1 waypoint4 waypoint10)
    (can_traverse rover1 waypoint10 waypoint4)
    (can_traverse rover1 waypoint2 waypoint10)
    (can_traverse rover1 waypoint10 waypoint2)
    (can_traverse rover1 waypoint4 waypoint6)
    (can_traverse rover1 waypoint6 waypoint4)
    (can_traverse rover2 waypoint6 waypoint2)
    (can_traverse rover2 waypoint10 waypoint5)
    (can_traverse rover2 waypoint2 waypoint4)
    (can_traverse rover2 waypoint3 waypoint8)
    (can_traverse rover2 waypoint9 waypoint3)
    (can_traverse rover2 waypoint1 waypoint5)
    (can_traverse rover2 waypoint5 waypoint1)
    (can_traverse rover2 waypoint4 waypoint2)
    (can_traverse rover2 waypoint6 waypoint7)
    (can_traverse rover2 waypoint9 waypoint5)
    (can_traverse rover2 waypoint7 waypoint6)
    (can_traverse rover2 waypoint2 waypoint6)
    (can_traverse rover2 waypoint5 waypoint10)
    (can_traverse rover2 waypoint3 waypoint9)
    (can_traverse rover2 waypoint8 waypoint3)
    (can_traverse rover2 waypoint5 waypoint9)
    (can_traverse rover2 waypoint2 waypoint5)
    (can_traverse rover2 waypoint5 waypoint2)
    (can_traverse rover2 waypoint1 waypoint9)
    (can_traverse rover2 waypoint9 waypoint1)
    (can_traverse rover2 waypoint7 waypoint8)
    (can_traverse rover2 waypoint8 waypoint7)
    (can_traverse rover2 waypoint4 waypoint8)
    (can_traverse rover2 waypoint8 waypoint4)
    (can_traverse rover2 waypoint4 waypoint10)
    (can_traverse rover2 waypoint10 waypoint4)
    (can_traverse rover2 waypoint4 waypoint6)
    (can_traverse rover2 waypoint6 waypoint4)
    (can_traverse rover3 waypoint6 waypoint2)
    (can_traverse rover3 waypoint10 waypoint5)
    (can_traverse rover3 waypoint2 waypoint4)
    (can_traverse rover3 waypoint3 waypoint8)
    (can_traverse rover3 waypoint9 waypoint3)
    (can_traverse rover3 waypoint1 waypoint5)
    (can_traverse rover3 waypoint5 waypoint1)
    (can_traverse rover3 waypoint4 waypoint2)
    (can_traverse rover3 waypoint6 waypoint7)
    (can_traverse rover3 waypoint9 waypoint5)
    (can_traverse rover3 waypoint7 waypoint6)
    (can_traverse rover3 waypoint2 waypoint6)
    (can_traverse rover3 waypoint5 waypoint10)
    (can_traverse rover3 waypoint3 waypoint9)
    (can_traverse rover3 waypoint8 waypoint3)
    (can_traverse rover3 waypoint5 waypoint9)
    (can_traverse rover3 waypoint2 waypoint5)
    (can_traverse rover3 waypoint5 waypoint2)
    (can_traverse rover3 waypoint2 waypoint3)
    (can_traverse rover3 waypoint3 waypoint2)
    (can_traverse rover3 waypoint1 waypoint9)
    (can_traverse rover3 waypoint9 waypoint1)
    (can_traverse rover3 waypoint4 waypoint10)
    (can_traverse rover3 waypoint10 waypoint4)
    (can_traverse rover3 waypoint2 waypoint10)
    (can_traverse rover3 waypoint10 waypoint2)
    (can_traverse rover3 waypoint4 waypoint6)
    (can_traverse rover3 waypoint6 waypoint4)
    (can_traverse rover3 waypoint7 waypoint10)
    (can_traverse rover3 waypoint10 waypoint7)
    (can_traverse rover4 waypoint6 waypoint2)
    (can_traverse rover4 waypoint10 waypoint5)
    (can_traverse rover4 waypoint2 waypoint4)
    (can_traverse rover4 waypoint3 waypoint8)
    (can_traverse rover4 waypoint9 waypoint3)
    (can_traverse rover4 waypoint1 waypoint5)
    (can_traverse rover4 waypoint5 waypoint1)
    (can_traverse rover4 waypoint4 waypoint2)
    (can_traverse rover4 waypoint6 waypoint7)
    (can_traverse rover4 waypoint9 waypoint5)
    (can_traverse rover4 waypoint7 waypoint6)
    (can_traverse rover4 waypoint2 waypoint6)
    (can_traverse rover4 waypoint5 waypoint10)
    (can_traverse rover4 waypoint3 waypoint9)
    (can_traverse rover4 waypoint8 waypoint3)
    (can_traverse rover4 waypoint5 waypoint9)
    (can_traverse rover4 waypoint2 waypoint5)
    (can_traverse rover4 waypoint5 waypoint2)
    (can_traverse rover4 waypoint1 waypoint4)
    (can_traverse rover4 waypoint4 waypoint1)
    (can_traverse rover4 waypoint4 waypoint10)
    (can_traverse rover4 waypoint10 waypoint4)
    (can_traverse rover4 waypoint4 waypoint6)
    (can_traverse rover4 waypoint6 waypoint4)
    (can_traverse rover4 waypoint7 waypoint10)
    (can_traverse rover4 waypoint10 waypoint7)
    (calibration_target camera1 objective10)
    (on_board camera1 rover2)
    (supports camera1 low_res)
    (supports camera1 colour)
    (supports camera1 high_res)
    (calibration_target camera2 objective3)
    (on_board camera2 rover1)
    (supports camera2 high_res)
    (calibration_target camera3 objective6)
    (on_board camera3 rover3)
    (supports camera3 colour)
    (supports camera3 low_res)
    (calibration_target camera4 objective4)
    (on_board camera4 rover4)
    (supports camera4 high_res)
    (supports camera4 colour)
    (supports camera4 low_res)
    (visible_from objective1 waypoint2)
    (visible_from objective1 waypoint8)
    (visible_from objective1 waypoint1)
    (visible_from objective2 waypoint7)
    (visible_from objective2 waypoint6)
    (visible_from objective2 waypoint3)
    (visible_from objective2 waypoint9)
    (visible_from objective2 waypoint1)
    (visible_from objective2 waypoint8)
    (visible_from objective3 waypoint3)
    (visible_from objective3 waypoint10)
    (visible_from objective3 waypoint7)
    (visible_from objective3 waypoint6)
    (visible_from objective4 waypoint1)
    (visible_from objective5 waypoint4)
    (visible_from objective5 waypoint8)
    (visible_from objective5 waypoint10)
    (visible_from objective5 waypoint2)
    (visible_from objective5 waypoint6)
    (visible_from objective6 waypoint5)
    (visible_from objective6 waypoint2)
    (visible_from objective6 waypoint3)
    (visible_from objective6 waypoint7)
    (visible_from objective6 waypoint9)
    (visible_from objective6 waypoint6)
    (visible_from objective6 waypoint1)
    (visible_from objective6 waypoint4)
    (visible_from objective6 waypoint10)
    (visible_from objective6 waypoint8)
    (visible_from objective7 waypoint6)
    (visible_from objective8 waypoint4)
    (visible_from objective8 waypoint8)
    (visible_from objective8 waypoint2)
    (visible_from objective8 waypoint10)
    (visible_from objective8 waypoint3)
    (visible_from objective9 waypoint5)
    (visible_from objective10 waypoint9)
    (visible_from objective10 waypoint7)
    (visible_from objective10 waypoint5))
 (:goal  (and 
    (communicated_rock_data waypoint4)
    (communicated_rock_data waypoint1)
    (communicated_rock_data waypoint5)
    (communicated_rock_data waypoint2)
    (communicated_rock_data waypoint8)
    (communicated_soil_data waypoint8)
    (communicated_soil_data waypoint9)
    (communicated_image_data objective10 low_res)
    (communicated_image_data objective1 high_res)
    (communicated_image_data objective4 low_res)
    (communicated_image_data objective4 colour)
    (communicated_image_data objective2 low_res)
    (communicated_image_data objective2 high_res)
    (communicated_image_data objective6 high_res)
    (communicated_image_data objective5 colour)
    (communicated_image_data objective3 high_res)
    (communicated_image_data objective8 colour)
    (communicated_image_data objective6 colour)
    (communicated_image_data objective7 colour)
    (communicated_image_data objective5 high_res))))

; plan
1. (sample_soil rover2 rover2store waypoint8)
   deleted: (empty rover2store) (at_soil_sample waypoint8)
   added: (full rover2store) (have_soil_analysis rover2 waypoint8)
   goals met: 0 of 20
2. (drop rover2 rover2store)
   deleted: (full rover2store)
   added: (empty rover2store)
   goals met: 0 of 20
3. (navigate rover2 waypoint8 waypoint4)
   deleted: (at rover2 waypoint8)
   added: (at rover2 waypoint4)
   goals met: 0 of 20
4. (communicate_soil_data rover2 general waypoint8 waypoint4 waypoint8)
   added: (communicated_soil_data waypoint8)
   goals met: 1 of 20
5. (navigate rover2 waypoint4 waypoint2)
   deleted: (at rover2 waypoint4)
   added: (at rover2 waypoint2)
   goals met: 1 of 20
6. (navigate rover2 waypoint2 waypoint5)
   deleted: (at rover2 waypoint2)
   added: (at rover2 waypoint5)
   goals met: 1 of 20
7. (navigate rover2 waypoint5 waypoint9)
   deleted: (at rover2 waypoint5)
   added: (at rover2 waypoint9)
   goals met: 1 of 20
8. (sample_soil rover2 rover2store waypoint9)
   deleted: (empty rover2store) (at_soil_sample waypoint9)
   added: (full rover2store) (have_soil_analysis rover2 waypoint9)
   goals met: 1 of 20
9. (drop rover2 rover2store)
   deleted: (full rover2store)
   added: (empty rover2store)
   goals met: 1 of 20
10. (communicate_soil_data rover2 general waypoint9 waypoint9 waypoint8)
   added: (communicated_soil_data waypoint9)
   goals met: 2 of 20
11. (navigate rover2 waypoint9 waypoint5)
   deleted: (at rover2 waypoint9)
   added: (at rover2 waypoint5)
   goals met: 2 of 20
12. (navigate rover2 waypoint5 waypoint2)
   deleted: (at rover2 waypoint5)
   added: (at rover2 waypoint2)
   goals met: 2 of 20
13. (navigate rover2 waypoint2 waypoint4)
   deleted: (at rover2 waypoint2)
   added: (at rover2 waypoint4)
   goals met: 2 of 20
14. (sample_rock rover2 rover2store waypoint4)
   deleted: (empty rover2store) (at_rock_sample waypoint4)
   added: (full rover2store) (have_rock_analysis rover2 waypoint4)
   goals met: 2 of 20
15. (drop rover2 rover2store)
   deleted: (full rover2store)
   added: (empty rover2store)
   goals met: 2 of 20
16. (communicate_rock_data rover2 general waypoint4 waypoint4 waypoint8)
   added: (communicated_rock_data waypoint4)
   goals met: 3 of 20
17. (navigate rover2 waypoint4 waypoint2)
   deleted: (at rover2 waypoint4)
   added: (at rover2 waypoint2)
   goals met: 3 of 20
18. (navigate rover2 waypoint2 waypoint5)
   deleted: (at rover2 waypoint2)
   added: (at rover2 waypoint5)
   goals met: 3 of 20
19. (navigate rover2 waypoint5 waypoint1)
   deleted: (at rover2 waypoint5)
   added: (at rover2 waypoint1)
   goals met: 3 of 20
20. (sample_rock rover2 rover2store waypoint1)
   deleted: (empty rover2store) (at_rock_sample waypoint1)
   added: (full rover2store) (have_rock_analysis rover2 waypoint1)
   goals met: 3 of 20
21. (drop rover2 rover2store)
   deleted: (full rover2store)
   added: (empty rover2store)
   goals met: 3 of 20
22. (navigate rover2 waypoint1 waypoint9)
   deleted: (at rover2 waypoint1)
   added: (at rover2 waypoint9)
   goals met: 3 of 20
23. (communicate_rock_data rover2 general waypoint1 waypoint9 waypoint8)
   added: (communicated_rock_data waypoint1)
   goals met: 4 of 20
24. (navigate rover2 waypoint9 waypoint5)
   deleted: (at rover2 waypoint9)
   added: (at rover2 waypoint5)
   goals met: 4 of 20
25. (sample_rock rover2 rover2store waypoint5)
   deleted: (empty rover2store) (at_rock_sample waypoint5)
   added: (full rover2store) (have_rock_analysis rover2 waypoint5)
   goals met: 4 of 20
26. (drop rover2 rover2store)
   deleted: (full rover2store)
   added: (empty rover2store)
   goals met: 4 of 20
27. (navigate rover2 waypoint5 waypoint2)
   deleted: (at rover2 waypoint5)
   added: (at rover2 waypoint2)
   goals met: 4 of 20
28. (communicate_rock_data rover2 general waypoint5 waypoint2 waypoint8)
   added: (communicated_rock_data waypoint5)
   goals met: 5 of 20
29. (sample_rock rover2 rover2store waypoint2)
   deleted: (empty rover2store) (at_rock_sample waypoint2)
   added: (full rover2store) (have_rock_analysis rover2 waypoint2)
   goals met: 5 of 20
30. (drop rover2 rover2store)
   deleted: (full rover2store)
   added: (empty rover2store)
   goals met: 5 of 20
31. (communicate_rock_data rover2 general waypoint2 waypoint2 waypoint8)
   added: (communicated_rock_data waypoint2)
   goals met: 6 of 20
32. (navigate rover2 waypoint2 waypoint4)
   deleted: (at rover2 waypoint2)
   added: (at rover2 waypoint4)
   goals met: 6 of 20
33. (navigate rover2 waypoint4 waypoint8)
   deleted: (at rover2 waypoint4)
   added: (at rover2 waypoint8)
   goals met: 6 of 20
34. (sample_rock rover2 rover2store waypoint8)
   deleted: (empty rover2store) (at_rock_sample waypoint8)
   added: (full rover2store) (have_rock_analysis rover2 waypoint8)
   goals met: 6 of 20
35. (drop rover2 rover2store)
   deleted: (full rover2store)
   added: (empty rover2store)
   goals met: 6 of 20
36. (navigate rover2 waypoint8 waypoint4)
   deleted: (at rover2 waypoint8)
   added: (at rover2 waypoint4)
   goals met: 6 of 20
37. (communicate_rock_data rover2 general waypoint8 waypoint4 waypoint8)
   added: (communicated_rock_data waypoint8)
   goals met: 7 of 20
38. (calibrate rover3 camera3 objective6 waypoint6)
   added: (calibrated camera3 rover3)
   goals met: 7 of 20
39. (navigate rover3 waypoint6 waypoint7)
   deleted: (at rover3 waypoint6)
   added: (at rover3 waypoint7)
   goals met: 7 of 20
40. (take_image rover3 waypoint7 objective10 camera3 low_res)
   deleted: (calibrated camera3 rover3)
   added: (have_image rover3 objective10 low_res)
   goals met: 7 of 20
41. (communicate_image_data rover3 general objective10 low_res waypoint7 waypoint8)
   added: (communicated_image_data objective10 low_res)
   goals met: 8 of 20
42. (navigate rover4 waypoint10 waypoint4)
   deleted: (at rover4 waypoint10)
   added: (at rover4 waypoint4)
   goals met: 8 of 20
43. (navigate rover4 waypoint4 waypoint1)
   deleted: (at rover4 waypoint4)
   added: (at rover4 waypoint1)
   goals met: 8 of 20
44. (calibrate rover4 camera4 objective4 waypoint1)
   added: (calibrated camera4 rover4)
   goals met: 8 of 20
45. (take_image rover4 waypoint1 objective1 camera4 high_res)
   deleted: (calibrated camera4 rover4)
   added: (have_image rover4 objective1 high_res)
   goals met: 8 of 20
46. (navigate rover4 waypoint1 waypoint4)
   deleted: (at rover4 waypoint1)
   added: (at rover4 waypoint4)
   goals met: 8 of 20
47. (communicate_image_data rover4 general objective1 high_res waypoint4 waypoint8)
   added: (communicated_image_data objective1 high_res)
   goals met: 9 of 20
48. (calibrate rover3 camera3 objective6 waypoint7)
   added: (calibrated camera3 rover3)
   goals met: 9 of 20
49. (navigate rover3 waypoint7 waypoint10)
   deleted: (at rover3 waypoint7)
   added: (at rover3 waypoint10)
   goals met: 9 of 20
50. (navigate rover3 waypoint10 waypoint5)
   deleted: (at rover3 waypoint10)
   added: (at rover3 waypoint5)
   goals met: 9 of 20
51. (navigate rover3 waypoint5 waypoint1)
   deleted: (at rover3 waypoint5)
   added: (at rover3 waypoint1)
   goals met: 9 of 20
52. (take_image rover3 waypoint1 objective4 camera3 low_res)
   deleted: (calibrated camera3 rover3)
   added: (have_image rover3 objective4 low_res)
   goals met: 9 of 20
53. (navigate rover3 waypoint1 waypoint9)
   deleted: (at rover3 waypoint1)
   added: (at rover3 waypoint9)
   goals met: 9 of 20
54. (communicate_image_data rover3 general objective4 low_res waypoint9 waypoint8)
   added: (communicated_image_data objective4 low_res)
   goals met: 10 of 20
55. (calibrate rover3 camera3 objective6 waypoint9)
   added: (calibrated camera3 rover3)
   goals met: 10 of 20
56. (navigate rover3 waypoint9 waypoint1)
   deleted: (at rover3 waypoint9)
   added: (at rover3 waypoint1)
   goals met: 10 of 20
57. (take_image rover3 waypoint1 objective4 camera3 colour)
   deleted: (calibrated camera3 rover3)
   added: (have_image rover3 objective4 colour)
   goals met: 10 of 20
58. (navigate rover3 waypoint1 waypoint9)
   deleted: (at rover3 waypoint1)
   added: (at rover3 waypoint9)
   goals met: 10 of 20
59. (communicate_image_data rover3 general objective4 colour waypoint9 waypoint8)
   added: (communicated_image_data objective4 colour)
   goals met: 11 of 20
60. (calibrate rover3 camera3 objective6 waypoint9)
   added: (calibrated camera3 rover3)
   goals met: 11 of 20
61. (take_image rover3 waypoint9 objective2 camera3 low_res)
   deleted: (calibrated camera3 rover3)
   added: (have_image rover3 objective2 low_res)
   goals met: 11 of 20
62. (communicate_image_data rover3 general objective2 low_res waypoint9 waypoint8)
   added: (communicated_image_data objective2 low_res)
   goals met: 12 of 20
63. (navigate rover4 waypoint4 waypoint1)
   deleted: (at rover4 waypoint4)
   added: (at rover4 waypoint1)
   goals met: 12 of 20
64. (calibrate rover4 camera4 objective4 waypoint1)
   added: (calibrated camera4 rover4)
   goals met: 12 of 20
65. (take_image rover4 waypoint1 objective2 camera4 high_res)
   deleted: (calibrated camera4 rover4)
   added: (have_image rover4 objective2 high_res)
   goals met: 12 of 20
66. (navigate rover4 waypoint1 waypoint4)
   deleted: (at rover4 waypoint1)
   added: (at rover4 waypoint4)
   goals met: 12 of 20
67. (communicate_image_data rover4 general objective2 high_res waypoint4 waypoint8)
   added: (communicated_image_data objective2 high_res)
   goals met: 13 of 20
68. (navigate rover4 waypoint4 waypoint1)
   deleted: (at rover4 waypoint4)
   added: (at rover4 waypoint1)
   goals met: 13 of 20
69. (calibrate rover4 camera4 objective4 waypoint1)
   added: (calibrated camera4 rover4)
   goals met: 13 of 20
70. (take_image rover4 waypoint1 objective6 camera4 high_res)
   deleted: (calibrated camera4 rover4)
   added: (have_image rover4 objective6 high_res)
   goals met: 13 of 20
71. (navigate rover4 waypoint1 waypoint4)
   deleted: (at rover4 waypoint1)
   added: (at rover4 waypoint4)
   goals met: 13 of 20
72. (communicate_image_data rover4 general objective6 high_res waypoint4 waypoint8)
   added: (communicated_image_data objective6 high_res)
   goals met: 14 of 20
73. (calibrate rover3 camera3 objective6 waypoint9)
   added: (calibrated camera3 rover3)
   goals met: 14 of 20
74. (navigate rover3 waypoint9 waypoint5)
   deleted: (at rover3 waypoint9)
   added: (at rover3 waypoint5)
   goals met: 14 of 20
75. (navigate rover3 waypoint5 waypoint2)
   deleted: (at rover3 waypoint5)
   added: (at rover3 waypoint2)
   goals met: 14 of 20
76. (take_image rover3 waypoint2 objective5 camera3 colour)
   deleted: (calibrated camera3 rover3)
   added: (have_image rover3 objective5 colour)
   goals met: 14 of 20
77. (communicate_image_data rover3 general objective5 colour waypoint2 waypoint8)
   added: (communicated_image_data objective5 colour)
   goals met: 15 of 20
78. (navigate rover4 waypoint4 waypoint1)
   deleted: (at rover4 waypoint4)
   added: (at rover4 waypoint1)
   goals met: 15 of 20
79. (calibrate rover4 camera4 objective4 waypoint1)
   added: (calibrated camera4 rover4)
   goals met: 15 of 20
80. (navigate rover4 waypoint1 waypoint4)
   deleted: (at rover4 waypoint1)
   added: (at rover4 waypoint4)
   goals met: 15 of 20
81. (navigate rover4 waypoint4 waypoint10)
   deleted: (at rover4 waypoint4)
   added: (at rover4 waypoint10)
   goals met: 15 of 20
82. (take_image rover4 waypoint10 objective3 camera4 high_res)
   deleted: (calibrated camera4 rover4)
   added: (have_image rover4 objective3 high_res)
   goals met: 15 of 20
83. (navigate rover4 waypoint10 waypoint4)
   deleted: (at rover4 waypoint10)
   added: (at rover4 waypoint4)
   goals met: 15 of 20
84. (communicate_image_data rover4 general objective3 high_res waypoint4 waypoint8)
   added: (communicated_image_data objective3 high_res)
   goals met: 16 of 20
85. (calibrate rover3 camera3 objective6 waypoint2)
   added: (calibrated camera3 rover3)
   goals met: 16 of 20
86. (take_image rover3 waypoint2 objective8 camera3 colour)
   deleted: (calibrated camera3 rover3)
   added: (have_image rover3 objective8 colour)
   goals met: 16 of 20
87. (communicate_image_data rover3 general objective8 colour waypoint2 waypoint8)
   added: (communicated_image_data objective8 colour)
   goals met: 17 of 20
88. (calibrate rover3 camera3 objective6 waypoint2)
   added: (calibrated camera3 rover3)
   goals met: 17 of 20
89. (take_image rover3 waypoint2 objective6 camera3 colour)
   deleted: (calibrated camera3 rover3)
   added: (have_image rover3 objective6 colour)
   goals met: 17 of 20
90. (communicate_image_data rover3 general objective6 colour waypoint2 waypoint8)
   added: (communicated_image_data objective6 colour)
   goals met: 18 of 20
91. (calibrate rover3 camera3 objective6 waypoint2)
   added: (calibrated camera3 rover3)
   goals met: 18 of 20
92. (navigate rover3 waypoint2 waypoint6)
   deleted: (at rover3 waypoint2)
   added: (at rover3 waypoint6)
   goals met: 18 of 20
93. (take_image rover3 waypoint6 objective7 camera3 colour)
   deleted: (calibrated camera3 rover3)
   added: (have_image rover3 objective7 colour)
   goals met: 18 of 20
94. (navigate rover3 waypoint6 waypoint4)
   deleted: (at rover3 waypoint6)
   added: (at rover3 waypoint4)
   goals met: 18 of 20
95. (communicate_image_data rover3 general objective7 colour waypoint4 waypoint8)
   added: (communicated_image_data objective7 colour)
   goals met: 19 of 20
96. (navigate rover4 waypoint4 waypoint1)
   deleted: (at rover4 waypoint4)
   added: (at rover4 waypoint1)
   goals met: 19 of 20
97. (calibrate rover4 camera4 objective4 waypoint1)
   added: (calibrated camera4 rover4)
   goals met: 19 of 20
98. (navigate rover4 waypoint1 waypoint4)
   deleted: (at rover4 waypoint1)
   added: (at rover4 waypoint4)
   goals met: 19 of 20
99. (take_image rover4 waypoint4 objective5 camera4 high_res)
   deleted: (calibrated camera4 rover4)
   added: (have_image rover4 objective5 high_res)
   goals met: 19 of 20
100. (communicate_image_data rover4 general objective5 high_res waypoint4 waypoint8)
   added: (communicated_image_data objective5 high_res)
   goals met: 20 of 20
